# -*- coding: utf-8 -*-
from pythainlp.tokenize.newmm import mmcut
from pythainlp.corpus.thaiword import get_data
import simplebayes
import nltk.tag
import dill
bayes = simplebayes.SimpleBayes()
patterns = [
      ('สวัสดี', 'greeting'),
      ('ชื่ออะไร', 'name'),
      ('อายุ', 'ago'),
      ('คุณคือ', "who're you"),
      ('บริษัท','5'),
      ('มาทำไม','6'),
      ('งานนี้','7'),
      ('ผู้จัด','8'),
      ('สถานที่จัดงาน','9'),
      ('ระยะเวลา','10'),
      ('ผู้สนับสนุน','11'),
      ('วัตถุประสงค์','12'),
      ('ประธาน','13'),
      ('นายก','14'),
      ('รัชกาลที่ 9','15'),
      ('รัชกาลที่ 10','16'),
      ('พระราชินี','17'),
      ('สาขา','18'),
      ('บริษัททำเกี่ยวกับ','19'),
      ('สินค้า','20'),
      ('ตั้งอยู่ที่ไหน','21'),
      ('สมัครงาน','22'),
      ('สนใจใช้บริการ','23'),
      ('ความสามารถของพิน','24'),
      ('อนาคตไลฟ์ไทม์','25'),
      ('การติดต่อ','26'),
      ('iBG','27'),
      ('คำชม','28'),
      ('ไม่เข้าใจคำถาม','29'),
      ('สีของบริษัท','30'),
      ('VOIP','31'),
      ('Chatbot','32'),
      ('ปลัด','33'),
      ('รู้อะไรบ้าง','34'),
      ('ความรัก','35'),
      ('ดารา','36'),
      ('เหนื่อย','37'),
      ('อากาศ','38'),
      ('เต้น','39'),
      ('ลาก่อน','40'),
      ('ไปไหม','41'),
      ('เจ๋ง','42'),
      ('ราคา','43'),
      ('กินข้าวหรือยัง','44'),
      ('คำขวัญวันเด็ก','45'),
      ('Blockchain','46'),
      ('ภาษาที่พูดได้','47'),
      ('เบอร์โทรศัพท์','48'),
      ('ร้องเพลง','49'),
      ('ของรางวัล','50'),
      ('รถไฟฟ้าที่ใกล้ที่สุด','51'),
      ('ไก่กับไข่อะไรเกิดก่อน','52'),
      ('หวยออกอะไร','53'),
      ('ร้องเพลงให้ฟังหน่อย','54'),
      ('เหี้ย','55'),
      ('ยืมเงินได้ไหม','56'),
      ('ไปตายซะ','57'),
      ('เหงาจัง','58'),
      ('ทำอะไรอยู่','59'),
      ('หยุด','60'),
      ('ง่วง','61'),
      ('บริษัทมีอะไรใหม่','62'),
      ('สูงเท่าไหร่','63'),
      ('บริษัทขายอะไร','64'),
      ('ในงานมีเกมอะไร','65'),
      ('เที่ยวไหน','66'),
      ('ห้องน้ำอยู่ไหน','67'),
      ('ขอโทษนะ','68'),
      ('แต่งงานกันเถอะ','69'),
      ('คุณคิดยังไงกับฉัน','70'),
      ('\d+', 'num'),
      ('[^0-9a-zA-z\*]','word')
      ]
#sentences = input("input : ")
for data,tag in patterns:
	bayes.train(tag,data)
def tagger(sent):
      return bayes.classify(' '.join(mmcut(sent,[i[0] for i in patterns]+get_data())))
with open('patterns-classify-word-thai.data', 'wb') as out_strm: 
      dill.dump(patterns,out_strm)
with open('bayes-classify-word-thai.data', 'wb') as out_strm: 
      dill.dump(bayes,out_strm)
with open('classify-word-thai.data', 'wb') as out_strm: 
      dill.dump(tagger,out_strm)
#r=tagger(sentences)
#print(r)